{
    "description": "The code used to make my personal website.",
    "files": [],
    "name": "Studio Sleepy Giraffe",
    "path": "/home/toben/Code/ssg/studiosleepygiraffe",
    "posts": [
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-11-23",
            "message": "I've got a basic activity feed on the bottom of the page now. It's not pretty but it utalizes the feed feature. Good enough for the time being. I'm planning on doing a redesign to make my website more flash and to get more attention. ",
            "project": "studiosleepygiraffe",
            "title": "Activity feed"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-11-16",
            "message": "Both the Ruby API and the Python API fully pass the unit tests. The two are identical as far as I can tell. Now then, time to do some more updates to the front end. Specifically I want to have a feed display what I've been up to on the home page. ",
            "project": "studiosleepygiraffe",
            "title": "Got it!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-11-16",
            "message": "The ruby Json feed is now compliant. Now I need to get the rss feed working. ",
            "project": "studiosleepygiraffe",
            "title": "Fixed Ruby json feed."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-11-02",
            "message": "I can't seem to get the RSS feed to work. I'm mostly having trouble just getting the template to be found. I'm not sure how the logic around finding the template works. ",
            "project": "studiosleepygiraffe",
            "title": "Json feed working, but not rss."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-22",
            "message": "I forgot to update tags. I think I've got everything now. ",
            "project": "studiosleepygiraffe",
            "title": "Missed tags!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-22",
            "message": "I believe I've got the UI all on to the API now. Which is great! The content will finally flow! My blog posts from June and July will finally be visible! ",
            "project": "studiosleepygiraffe",
            "title": "Few more updates to UI."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-22",
            "message": "removing ruby version specification since this api is compliant with both version of ruby I'm using and I have different versions of Ruby on my desktop and on my server. So specifying a ruby version causes one to not run. ",
            "project": "studiosleepygiraffe",
            "title": "Updating Gemfile."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-22",
            "message": "There were a number of things that the Ruby API was not providing. I still have an number of things to do on the Ruby API but I want to get it mostly functional so I can actually use it. ",
            "project": "studiosleepygiraffe",
            "title": "Ruby quick fixes."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-19",
            "message": "I gotten ruby logs to now be compliant with the API. Found some un-used code in they python api while I was at it. This just leaves the rss and json feeds left to implement and then the Ruby API is fully in compliance with the Python API. I'll be happy when I have finished this and can actually get it out to my website at long last. ",
            "project": "studiosleepygiraffe",
            "title": "Ruby Logs now compliant."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-19",
            "message": "This didn't take much effort, I already had it mostly done, just needed a little bit of tweaking. ",
            "project": "studiosleepygiraffe",
            "title": "Ruby compliant on logs."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-19",
            "message": "Ruby API now compliant with the posts battery of tests. 3 batteries left to code. ",
            "project": "studiosleepygiraffe",
            "title": "One more down."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-10-12",
            "message": "Man, I didn't think it would require such a different mind sets. And while it is true that the logic stays the same Ruby is a much more \"magical\" language, which admittedly I do not like. I don't like it when Java tries to be \"magical\" I don't like it when Python tries to be \"magical\" as being \"magical\" usually means hiding details so it is impossible to follow the flow of information.\n\nIn this case the problem I'm trying to wrap my head around is implicity returns. The last statement of a ruby method is automatically returned. Interesting approach but they also seem to treat normal returns differently from python and other C descendants. I'm going to have to study this a little further to understand what is really going on here and how I get my method to return when I want it to. ",
            "project": "studiosleepygiraffe",
            "title": "I said I wanted to learn to think in ruby right?"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-09-23",
            "message": "The two naturally developed side by side, and as such they are now complete. Next step is to turn this on the ruby API. It will be nice to know that both APIs will be spitting out pretty darn near identical information. I can always add tests later on as I find discrepencies. Huzzah! Two more steps done. Once the Ruby API is done then I can turn my attention back to the front end and figure out how to switch between the two APIs on demand. ",
            "project": "studiosleepygiraffe",
            "title": "Validator and Python API done."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-29",
            "message": "I still need to work on the tags aspect of this, but I haven't really fleshed out how I want that to work. So I'm going to call it a day here. I'm going to go play Stardew valley until my daughter wakes up. ",
            "project": "studiosleepygiraffe",
            "title": "More of Validator done."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-28",
            "message": "I'm not consistent in the way I form the URLs in the API. I have made the test consistent for logs, I need to do it for projects yet, and then I need to fix the API so it provides consistent URLs as well.\n\nBut the good news is I'm about half way through the API validator. Should be done tomorrow morning depending on how long it takes me to make the muffins. ",
            "project": "studiosleepygiraffe",
            "title": "I've found a problem while making the unit tests."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-23",
            "message": "I have added an RSS2.0 compliant feed and a feed json object to the api to allow for feed readers and so I can put a feed up on the home page to display a quick look at what I am doing.\n\nThis has made me also realize that I should have in page anchors on my dev logs, so that one can link to a specific commit. The items in the feed right now just link to the project's page with all of the commits. ",
            "project": "studiosleepygiraffe",
            "title": "Python API now has Feeds!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-23",
            "message": "I have gotten the React side entirely back to functional with the new API as a backend. However I'm still far from ready to push this out to production. I rewrote the README.md for my website talking about features I have not yet implemented, like the Flask front end and the validators for both front and back ends. So I will need to finish up all of those before I push this out to the world. ",
            "project": "studiosleepygiraffe",
            "title": "Many updates to React.js"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-22",
            "message": "Well, it looks like my day must get started much ealier than planned. My little girl wants to go outside and play so I'll have to fiddle with this later.\n\nBut, that being said I did manage to get the post's files to show up in the post. So my simple systems posts are one step close to being able to be posted public. ",
            "project": "studiosleepygiraffe",
            "title": "Little girl wants to go play."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-21",
            "message": "Now that I have the python API fleshed out I'm rewiring the app to use the API to get its information. Mostly just changing urls, but here and there a few more indepth tweaks. Though Doing this has also pointed out to me one of the things I missed: Tags. Blog tags. I also will need to extend some of the React components to take advantage of new features. Most notably the files attached to blog posts. This is a feature I had to add to be able to share the work I've been doing on Simple Systems. Its been over a month I think since I finished that series and none of it is on my website yet. But The reason for that is I didn't have a good mechanism for sharing the code files. This primarily because I wanted it to be automatically wired in and not something I would have to manually enter for each post.\n\nAnyway. It is bed time, but a lot of the website has been updated. Tomorrow I'll try to finish it and then bring the Ruby API up to snuff and push both out to midgard. ",
            "project": "studiosleepygiraffe",
            "title": "Rewriting to use API"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-19",
            "message": "I've pasted what I originally implemented in Ruby and now have more functionality in the form of hosting files for projects and posts. The last thing I want to do is create a feed of some sort. Probably both rss and a json object feed that aggrigates across logs and posts to show what activity is happening on my website, and therefore what I am doing. ",
            "project": "studiosleepygiraffe",
            "title": "Python API almost up to new standard."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-18",
            "message": "I was going to work on projects to but it's a nice evening so we are going to take Lucy to the park instead. ",
            "project": "studiosleepygiraffe",
            "title": "Got file hosting working for posts."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-18",
            "message": "Took me about 1.5 hours to get here with python. Took about 5.5 hours with ruby. So I'm about 4 times better with python than I am Ruby. Not bad. ",
            "project": "studiosleepygiraffe",
            "title": "Python API up to snuff with Ruby."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-08-11",
            "message": "I'm working now on a python version of the API. I was going to make an API validator first but I'm going to write the validator primarily in python so I figured I should get the API done first since I'll probably caniblize that for code for testing. I'm tracking my time in producing both of these APIs to see how far I need to go to improve my Ruby expertise. ",
            "project": "studiosleepygiraffe",
            "title": "Started Python API"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-07-23",
            "message": "I hadn't noticed that rails creates a new git repo when you create a new project. I'm going to just paste my previous commit messages below. I just want the record of my though process more than anything.\n\ncommit 346b221e4801fe9c544dfc7b1713984790550f5f (HEAD -> master) Author: Toben Archer <sandslash@gmail.com> Date:   Thu Jul 23 14:23:52 2020 -0500\n\n    Minor tweak.\n\n    Turns out string interpolation only works if you use double quotes.\n\ncommit 0fd4de3dea965ab9f178cfeaf574d0dca258ef89 Author: Toben Archer <sandslash@gmail.com> Date:   Sun Jul 12 13:16:58 2020 -0500\n\n    That was quick.\n\n    Most of the changes in this commit are just making all the '\"' into \"'\".     The real work was changing 'info.json' to 'logs.json' and bam everything     works. Logs are being sent up now instead of the info file from the logs     controller. Fantastic! Now all that is left is the tags controller.\n\ncommit c4089058737d1a0596bc3965076dd30e218b745c Author: Toben Archer <sandslash@gmail.com> Date:   Sun Jul 12 12:56:52 2020 -0500\n\n    Polished everything but the gitposts.\n\n    I'll come back for the gitposts in a moment. Right now I need to go work     on the utility script that compiles git logs into json for use in this     way.\n\ncommit 5737dfa8256e88fa2adfe677d0c925061adad3a0 Author: Toben Archer <sandslash@gmail.com> Date:   Sat Jul 11 08:49:28 2020 -0500\n\n    With some help I'm off to the races!\n\n    I got a little bit of guidance from Reddit on how exactlty I was     supposed to get the things I needed. Once I got that nudge everything     else started falling into place. In the future all my projects, at least     those that I intend to share on my website, will have to have info.json     as well as README.md in their directory. I will probably also have their     cover pictures in their directory as well.\n\n    I got stumped a little here on gitposts. I want to encourage the system     to be as automatic as possible. But I am running this on an original     raspberry pi. I don't have the resources to process the entire git     history for each project on demand. So I am going to prebatch those and     set it up with some hooks. The posts will be loaded from a file that is     compiled when ever I push a new commit.\n\ncommit 3b83b52228cec83effed53e20541aa98499c3225 Author: Toben Archer <sandslash@gmail.com> Date:   Sat Jun 27 11:01:30 2020 -0500\n\n    Started work on my API in earnest.\n\n    I re-worked my blog to be useful to my objective of creating an API for     my website. So far I'm struggling with name spaces. I want to seperate     the api in to heirarchical pieces so that I can avoid name collisions     accross the various aspects I plan on making. I may just forget that     future proofing for the moment though and just make a simpler system     that gets the job done. ",
            "project": "studiosleepygiraffe",
            "title": "All the ruby at once."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-07-12",
            "message": "New era! I'm moving to use ruby to make an API for hosting my information. This has required me to update how my git posts are handled. ",
            "project": "studiosleepygiraffe",
            "title": "Updated generate-posts utility script."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-06-26",
            "message": "Now on to making this useful for me. ",
            "project": "studiosleepygiraffe",
            "title": "Finished the guide."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-06-19",
            "message": "Had a big supper, and its a little hot. I'm a little hazy as I work through this tutorial. But I got to step six tonight. Step 5 was certainly the largest part. I'm not about 3/4 of the way through so one more session should do it. ",
            "project": "studiosleepygiraffe",
            "title": "A little hazy."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-06-02",
            "message": "I'm working my way through this: https://guides.rubyonrails.org/getting_started.html\n\nI'm taking it slow because I want to understand this \"Rails\" way of doing things. So far it reminds me a lot of maven. I'm sure the two inspire each other. Certainly get the idea of convention over configuration, so I'm interested in seeing how this plays out. ",
            "project": "studiosleepygiraffe",
            "title": "Got to step 5.3"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-06-02",
            "message": "I have started work on an API to dynamically host the content for my website. I'm sure there are other more appropriate ways to do this but seperating the React front end entirely from the Ruby on Rails backend sounds like a nice clean way of doing it. ",
            "project": "studiosleepygiraffe",
            "title": "Initial commit of ruby API"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-05-28",
            "message": "The devlog is getting eronous data for the website's devlog and I can't figure out where. I have removed any and all reference to it, now I will rebuild and we'll see what happens. ",
            "project": "studiosleepygiraffe",
            "title": "Where is it getting that?"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-05-28",
            "message": "I updated the devlog posts to include dates so that the passage of time was a little more evidant. Makes it clear some of the things were well in the past but that's ok. ",
            "project": "studiosleepygiraffe",
            "title": "Updated devlog post."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-05-28",
            "message": "Excluding this one of course. Turns out the posts.json file is not currently responsible for the content in the devlog. That is managed by individual files. I really need to get around to building a proper backend for my site so all of the automations can be restored. ",
            "project": "studiosleepygiraffe",
            "title": "Actual post updates."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-05-28",
            "message": "I'm now using this new React version of my website as the default. I think I will try to setup a system where nginx redirects users to different versions, built on different technology stacks, based on cookies. I feel like nginx can probably do that. ",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'node'"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-05-28",
            "message": "I wrote a little squeel of delight over python this morning and wanted to push it into my site. I also want to update the git posts. That file has not been updated in quite a while. ",
            "project": "studiosleepygiraffe",
            "title": "Updating blog and git posts."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-03-23",
            "message": "I'm done! I've got everything up to acceptable. I'd say this puts my site at a comfortable beta. Right now I need to press on to the next task: Push this onto midgard and set it up with nginx. I decided I wanted to use nginx this time because it is easier to reverse proxy through than Apache, and I'd like to reverse proxy calibre from Udgard the media server. ",
            "project": "studiosleepygiraffe",
            "title": "Done! at least enough."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-03-10",
            "message": "I've got to figure out what exactly I want to do for the blog page. Just a list of boring looking links doesn't sound like a particularly great idea. They really don't look great right now, but alas it is bed time. But both projects and dev log are looking pretty good right now so I'm pleased with tonight's progress. ",
            "project": "studiosleepygiraffe",
            "title": "Most of the way there."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-03-10",
            "message": "I'm making a project link component since I will be using it from both the projects tab and the dev log tab. Right now I'm to the point where I need to bring in the pictures. So I'm going to save here and then go fetch them and come back. ",
            "project": "studiosleepygiraffe",
            "title": "Making good progress on styling."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-03-03",
            "message": "or at least the content is. All the parts are present. The posts, the tags that connect the posts, the resume, etc. I've also gotten the home page filled with content and the banner image in place. All that is left to do now is to get all the styling that is needed in place so it doesn't look really bad. The week after that I'll look into getting it hosted on nginx on midgard. And then I'll try my hand at some ruby on rails. That should be interesting. ",
            "project": "studiosleepygiraffe",
            "title": "The flesh is there."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-24",
            "message": "I've got the basics for the blog now in. It will take a little more effort to include the tags and cover arts. But that is true of all of the tabs: More work needed. The important thing is react router is now catching everything and navigating you to the pags. In fact only the resume page and the blog tags pages are yet to be made. Great progress! Hopefully next time I'm working on this all have the skeleton fully fleshed out and I will be able to start putting some flesh on to it. ",
            "project": "studiosleepygiraffe",
            "title": "Blog is now in."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-24",
            "message": "Route _exact_. That was what I was missing. Once I got that in then the router picked up everything as expected and everything worked great. Now onto the last tab in my tabbed navigation, the blog. ",
            "project": "studiosleepygiraffe",
            "title": "DevLogs now working."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-24",
            "message": "Trying to get devlogs working now but it's giving me some strange behavior. So I'm going to save before I do anything to damage the already working projects section. ",
            "project": "studiosleepygiraffe",
            "title": "Projects and and working."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-18",
            "message": "I've got projects dynamically loading urls now. It recieves a .json file of projects and creates the urls. Pretty basic stuff but a necessary step to getting this to work. ",
            "project": "studiosleepygiraffe",
            "title": "One last quick change for the evening."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-18",
            "message": "It is a radically different way of doing things than what I have been doing but I think I'll get the hang of it pretty quickly. I've got the parts that I couldn't figure out previously working, though the site is just a couple of p tags right now. I'm going to statically host the json files for now. It is simple enough to just update them from the OS when needed. That allows me to focus on getting the site up for now. ",
            "project": "studiosleepygiraffe",
            "title": "I have some bits working."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-18",
            "message": "Removed flask version.",
            "project": "studiosleepygiraffe",
            "title": "Removed flask version."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-18",
            "message": "I'm trying to get everything to work inside of my python/flask enviorment and I'm hitting road bumps. Everything assumes you are coding in a specific way, specifically node, and so if you aren't it no longer makes sense. So I'm going to try doing a react app by the book. ",
            "project": "studiosleepygiraffe",
            "title": "Running into some challenges."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-10",
            "message": "Merge branch 'react' of gitlab.com:narcolapser/studiosleepygiraffe into react",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'react' of gitlab.com:narcolapser/studiosleepygiraffe into react"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-10",
            "message": "I've got the main landing page back and the landing page for projects back up. I'm currently trying to get my head around how exactly one creates routes procedurally. I can of course have the javascript file be a template file and render the content in via python. But that doesn't feel like the right/pure way of doing this. So I'm going to keep looking. But I am pleased with what I have got so far. ",
            "project": "studiosleepygiraffe",
            "title": "A decent start."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-10",
            "message": "I moved the images into a sub folder of static to make that folder a little less crowded. I will be putting a number of .js files in there. I have now a basic app working with the react router. Now I just need to expand it to get all my old functionality back. ",
            "project": "studiosleepygiraffe",
            "title": "Moved images"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2020-02-10",
            "message": "I'm going to kind of rework my site again this time I'm going to leverage react router to allow it to be a single page app and also be a have functional urls and back button. ",
            "project": "studiosleepygiraffe",
            "title": "Rerouting"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-10-29",
            "message": "Merge branch 'react' of gitlab.com:narcolapser/studiosleepygiraffe into react",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'react' of gitlab.com:narcolapser/studiosleepygiraffe into react"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-10-29",
            "message": "I've learned a few things about importing recently and have added what I think should fix my blue prints problem, finally. ",
            "project": "studiosleepygiraffe",
            "title": "Getting blue prints working again."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-09-02",
            "message": "I think I've got everything polished to a shine now. Going to push this up to my website and go mow the lawn, boy is my brain tired. ",
            "project": "studiosleepygiraffe",
            "title": "Some tweaks and updates."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-31",
            "message": "I think I've got PDF export working again. It should now create the resume pdf on demand so I can update the resume.json file and the resume posted on my site should stay up to date. I also made a few tweaks to the layout of the blog pages. ",
            "project": "studiosleepygiraffe",
            "title": "Fixed pdf export."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-31",
            "message": "I merged the react branch in and have updated the website's commit posts now that the script doesn't get confused. Now I need to do a little tweaking to my blog displaying and update my resume. ",
            "project": "studiosleepygiraffe",
            "title": "Merged an more!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-31",
            "message": "I've updated the mark downs for various projects. A lot of spell checking and grammar checking. Some needed updated content in general. I rewrote the delta markdown from scratch as I haven't touched it since 2014, and this website was certainly not even in consideration back then. ",
            "project": "studiosleepygiraffe",
            "title": "Markdowns marked up."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-31",
            "message": "I made a few tweaks to the script that turns my commit messages into devlog posts. I set it up to only harvest my commits so I am not hosting other people's commits as if they were mine.\n\nAlso, it would seem the script does not want to run on my website while it is in a different un-commited branch. So hopefully it will work correctly as soon as I merge this into master. ",
            "project": "studiosleepygiraffe",
            "title": "Updates to post generation."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-31",
            "message": "Before I can really call this update done I need to update all the data driven backend of it. So I've updated the markdown for automatic-fiesta, dashlib, kivy_joystick, and o365. I've also removed some of my older (and deader) projects. ",
            "project": "studiosleepygiraffe",
            "title": "Added several items."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-30",
            "message": "I've merged these two pages as they were both rather sparce and a little redundant. So I've merged them into one page. The other reason is to get the about me front and center when some one comes to the page to begin with. Make it a little more me focused I suppose you could say. But hopefully in the \"You're here to hear about me, here's my info\" way and not the braggart way. ",
            "project": "studiosleepygiraffe",
            "title": "Merging of Home and About"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-30",
            "message": "I think I've got all the functional aspects except for Resume up and working again now. There are a few formating things that could be tightened up but this is a good point to commit. I also need to update all the data that backs the website. More recent gits more recent readmes. Of course those are generated so it's not a lot of effort but still it is something that I need to do. ",
            "project": "studiosleepygiraffe",
            "title": "Projects is up and working."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-30",
            "message": "I've got the web log portion of the site up and running now. It took an extra little tick because I render the markdown into HTML on the server. I could do this in react but I didn't want to load any modules in order to get my code to work. For now I'm using pure react while I'm just learning my way around. I'm not sure though in the end which I'd prefer, react parsing the mark down or python parsing the mark down. But the important thing is that it works for what I want right now. ",
            "project": "studiosleepygiraffe",
            "title": "Blog is joggin."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-30",
            "message": "I've got the basics of the Developer's log working. It will display projects and you can click on the projects to see the git commits, such as this one, for that project. The great thing is that the rest of the site is mostly a copy of this. Project and blog posts are basically the same thing as the dev log so I just need to make those components in their appropriate stylings.\n\nReact isn't to hard all in all. I do greatly appreciate having web components in my site at last. It's been over a year since I first learned about them and I've done vue and I've done polymer but never got around to doing them in my own site. If it weren't for the job offer at planning center I probably would have just done vue. I'm glad I got to try react, I think it's cleaner, at least with JSX. I wonder if there is a JSX Flask pluggin, that would be pretty cool. Well, onward! ",
            "project": "studiosleepygiraffe",
            "title": "It's all coming together now."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-29",
            "message": "Missed a bit.",
            "project": "studiosleepygiraffe",
            "title": "Missed a bit."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2019-08-29",
            "message": "I've made a fair bit of progress for a single afternoon working in react. I'll give it a little more effort tomorrow evening. Right now I need to setup the ajax part of the site so that it can lazy load the blog posts and such. But it is turning into a nice single page application. Fancy! ",
            "project": "studiosleepygiraffe",
            "title": "Trying to rebuild the site in react."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-12-19",
            "message": "I cleaned up the code base a fair bit as I am starting to make it PEP8 compliant. I'm also starting to use full words more often. This is partly do to me trying to use PyCharm as my ide. It's come again, the \"I should really use an IDE\" inklings. I think I may actually follow through on it this time. PyCharm isn't hindering me to terribly so I should be able to get over the hump to the point where it starts to accelerate me. Here's hoping. ",
            "project": "studiosleepygiraffe",
            "title": "Cleaning up and pressing on."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-12-13",
            "message": "Merge branch 'master' of gitlab.com:narcolapser/studiosleepygiraffe",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'master' of gitlab.com:narcolapser/studiosleepygiraffe"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-12-13",
            "message": "I've decided to switch to python3. This actually only has effects on one point of the code base, StringIO has been replaced with just io. Considering that is for the \"snow\" blueprint I may not even keep that around so the end result is a python agnostic code base.\n\nI've also added basic tracking. Now every request gets recorded into a database that I can query later. I don't know if anyone sees my site but this should give me some idea and using geo-ip I can potentially get some geographical data out of it. Since the purpose of this website is to be a portfolio it would be nice to see who is looking at it from where. The who will be quite challenging, but the IP is enough for the where. Once I have that information then I'd like to make some sort of display. ",
            "project": "studiosleepygiraffe",
            "title": "Python3 and Tracking."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-12-13",
            "message": "Conflicts: \tstudiosleepygiraffe/__init__.py ",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'resume'"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-12-12",
            "message": "There was a problem that was outstanding for a while that I've been wanting to fix but have never gotten around to it. blog posts have tags that when you click on them link you to a tags page so you can see all other posts with those tags. That last piece of it wasn't working. It would take you to a blank page. Got that sorted. I also moved the blog subsystem to its own blue print. This drops my __init__.py file down to about 100 lines of code. Probably about half the size it was when I started this endevour. Jolly good. ",
            "project": "studiosleepygiraffe",
            "title": "Updates to blog linking."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-12-12",
            "message": "I have started working migrating my code to blueprints so that I can work on it a lot easier. So I have moved the whole snow removal reporting subsystem out of __init__.py. I'll now move on to other parts of the website out to keep things nice and simpel.\n\nI also added a .gitignore, don't know how I missed that. ",
            "project": "studiosleepygiraffe",
            "title": "Start of the blueprinting process."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-10-15",
            "message": "I wanted to be able to control my kitchen lights from IFTTT, so I wrote a script that will allow me to pass through the commands with out actually opening my home network to arbitrary html requests. That would be bad.\n\nThis isn't entirely great since theoretically anyone could find this and take control of our kitchen lights. I'm not to concerned because that's a worthless target. They only draw 1A 12V so it's not like it can be used like our AC for malicious power grid attacks or anything like that. The worst they could do is make them constantly flash. ",
            "project": "studiosleepygiraffe",
            "title": "Added some basic home automation."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-02-28",
            "message": "I've added a resume feature to my website. Like everything it is data driven. I have a template for the skeleton of the resume but a JSON file is loaded that populates it with data. This commit is just a basic setup. I've copied in all of my information from my previous resume into the json file and formated it in a similar way. Honestly it looks somewhere between crap and bland. But it's a first step. Now that I've got the skeleton and data there I will clean up the template to make it look nicer and update the info in resume.json to be more accurate of recent developments. ",
            "project": "studiosleepygiraffe",
            "title": "Resume is now available, but needs some love."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-02-13",
            "message": "I decided to merge this in. I'm going to bring both snow and house pics to the master branch so I stop having an awkward half baked master branch. When the time comes I'll just remove these features. This is one of the glory's of git really. ",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'snow' into housepics"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-02-09",
            "message": "I added a system for creating snow shoveling invoices for my mom. She has me shovel snow outside the sorority she manages on occation and I wanted a nice simple way to keep track and make invoices for billing purposes. These are the invoices that get sent to the board so they need to look some what professional. I've also set it up to be easy to add each clearing and then re-generate the pdf. Now all I have to do is edit snow.csv, adding the days I shoveled snow and then at the end of the month, vist the PDF and down load it. Because of the rarity in which I need this feature, I'll probably not push it to carbon. ",
            "project": "studiosleepygiraffe",
            "title": "Snow removal!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-30",
            "message": "Merge branch 'master' into housepics",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'master' into housepics"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-30",
            "message": "Just a few little tweaks to get the json blog stuff working fully and correctly. I landed on using a hybrid system of json files and mark down files. Becuase writing a markdown file inside a json file is a terrible idea.  So instead, it gets both. You can specify in the json file what the markdown file is for the blog post. ",
            "project": "studiosleepygiraffe",
            "title": "Json blog refinement."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-29",
            "message": "I've been working a little bit on fleshing out the blog side of things. I now specifies that it was writen by me and what date, I'm not sure I need the author bit, but it's nice. I also added the ability to include a cover photo. These were achieved through making the content json instead of plain text files. The content of the post however remains mark down so I can still do formating.\n\nI also was working on tags for the posts. Ideally you'll be able to click on a tag in the post and see other posts that also have that tag. Just making the site feel complete really. I've thought about adding a similar feature to my git posts. Which I really need to dig into a little deeper anyway. ",
            "project": "studiosleepygiraffe",
            "title": "More blog features!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-24",
            "message": "I added two new utility scripts to keep everything up to date and safe. The first is a script that goes through all of the repos locally on carbon and pulls down the latest versions from mycroft. After doing this then the website's info can be updated, but that will be part of a pipeline sort of thing I develop later. The important thing is that I don't have to do each independantly now.\n\nThe second script makes an archive. It tarballs all the repos together and sends a copy over to mycroft. In it's final form it will also delete the tarball from carbon, but I had a hard drive scare a bit ago and so I don't want to leave all my data on mycroft. I plan on running this about once a week. Version control is plenty good, but I just want a backup my backup as the saying goes. Eventually this will upload to the cloud somewhere. ",
            "project": "studiosleepygiraffe",
            "title": "Backup and refresh"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-22",
            "message": "Put the index to home.html",
            "project": "studiosleepygiraffe",
            "title": "Put the index to home.html"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-22",
            "message": "Merge branch 'master' into housepics",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'master' into housepics"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-22",
            "message": "Common problem. Forgot to add the new files related to the blog portion of the site and the NCS player pictures. ",
            "project": "studiosleepygiraffe",
            "title": "Forgot the new files."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2018-01-22",
            "message": "I decided to add a blog. More details on why in my blog. Basically git posts and the project pages weren't quite sufficent for what I needed. I had content I wanted to post but no where to put it since all content had to be directly related to one of my projects.\n\nAlso new in this commit is the NCS Player. NCS Player is a proof of concept project. I have plans to make a video streaming app for independant content creators, but first I wanted to experiment around with something a little more constrained in scope. ",
            "project": "studiosleepygiraffe",
            "title": "NCS Player and blog."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-12-06",
            "message": "Merge branch 'housepics' of mycroft:/media/toben/Eurus/ssg_projects/studiosleepygiraffe into housepics",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'housepics' of mycroft:/media/toben/Eurus/ssg_projects/studiosleepygiraffe into housepics"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-12-06",
            "message": "Conflicts: \tstudiosleepygiraffe/__init__.py ",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'active' into housepics"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-11-14",
            "message": "Merge branch 'master' into housepics",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'master' into housepics"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-10-16",
            "message": "Not much changed in this commit. I've added pictures for o365, automatic fiest, and dashlib. I also rearranged the repos a little. I moved Dashlib up, reflecting it's maturity over some of the other projects.\n\nBut the excitment tonight is I've got a published game! Gravity Duel is now available on the google play store! I've acctually accomplished it! I have a published game! w00t! So I wanted to throw a little polish onto my website in celebration. I'm so happy! ",
            "project": "studiosleepygiraffe",
            "title": "Night of publishing."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-09-29",
            "message": "I've centered the titles on all the pages, I also got the navbar to be centered. Makes it look a lot more intentional now. ",
            "project": "studiosleepygiraffe",
            "title": "The centering of things!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-09-27",
            "message": "Up to 10 now that I'm including on my website. They range from the \"Wait, I decided that was worth talking about?\" To O365, a like legitamate library that has a fairly substantial following. Though I will now need to get some more pictures for the other projects.\n\nI'm moving all of my repos from various locations to being hosted on mycroft primarily. From there the repos will be cloned to my disprate machines, or disprate locations on the same machine. This centeralizing simplifies things by making my life a little more consistent and organized. I'm also having each project cloned locally on carbon so that the utility scripts can find the projects easily. ",
            "project": "studiosleepygiraffe",
            "title": "More projects!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-09-25",
            "message": "I think I've got it to a basic presentable level. I set all but the projects tab to fill only 50% of the screen so it's not spread so thin. Projects will probably need some formating of their own, but for now this will do. I also changed the name from \"apps\" to \"projects\" since that more accurately reflects the nature of them. It isn't so much individual programs as much as it is various projects that I am working on. ",
            "project": "studiosleepygiraffe",
            "title": "Presentable."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-09-19",
            "message": "Extra little bits.",
            "project": "studiosleepygiraffe",
            "title": "Extra little bits."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-09-13",
            "message": "I've added a few things and changed the default home page to allow for family to see the pictures of houses we are looking at. This will probably go away in the near future, but it is convenient for now.\n\nIt took a little effort, but I even got lazy loading working on this. So the images now load when you call for them, and no earlier. That should keep it's load time low and also keep it very responsive. ",
            "project": "studiosleepygiraffe",
            "title": "Temporary house viewer."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-09-05",
            "message": "I've not got pictures for all of my current projects. Several of them aren't great, but they are sufficent. Place holders at very least.\n\nI made a few tweaks to the style.css trying to get it to put my picture inline with the text, no luck. Curse you HTML/CSS! Not behaving exactly as I want. How rude!\n\nThere was a small issue with the dev logs, the white space was not being rendered at all. This meant all my messages were just getting crunched together. There was an idea for a way to fix this that was rendering your content ask markdown and running it through a parser. This idea has merit. I could put markdown formating in my git commit messages to get even more information crammed into them. ",
            "project": "studiosleepygiraffe",
            "title": "Finished the pictures."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-08-29",
            "message": "I've made a huge pile of changes with this commit. Pictures have been added to most of the apps on the apps page. the pictures will naturallly flow behind the text for each application. I put down some basic pieces for about and contact, though some tweeking is still necessary. I've added a discription for each app.\n\nOver all this is really starting to close in on being a fleshed out website the way have been envisioning/desiring. I'm pleased! Just a little more and I'll be able to make it public facing. ",
            "project": "studiosleepygiraffe",
            "title": "Things are looking good!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-08-08",
            "message": "I changed all the templates to use inheritance from a base template, ssg.html. This makes each template just a little bit simplier and avoids me repeating myself. DRY woohoo!\n\nI also expanded the README.md quite a bit. I explained how the whole git-posting system works and why I use markdown for the project pages.\n\nMy next work will be in making things a little more fancy. I've got several ideas written down in my sketch book on how to make the apps page more exciting. I intend on making each app a kind of button with text and images inside. But of course automatically generated so I don't have to bog myself down with creating content for the website. Let the website create itself! ",
            "project": "studiosleepygiraffe",
            "title": "Template inheritance now in use."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-08-07",
            "message": "I've got style actually starting to appear on the website now. I banged my head against the flask-bootstrap templates for a while but in the end decided to not use the base templates and instead create my own. This requires a little more effort, but it allows me a lot more control. Since HTML is still something I'm trying to master, keeping it simple is a great help.\n\nI've downloaded a bootstrap css style. I can easily change the style of my whole site but just swapping these files out. Pretty neat really! Right now I've just choosen a simple black style. I'm found of sites that are primarily dark colors, it feels less straining to look at. As I add pictures and things, it may be less of a deal and I'll probably switch to a lighter style, but this works for now. ",
            "project": "studiosleepygiraffe",
            "title": "Style is coming!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-08",
            "message": "I've added the read me for the website's repo. Just space duel left to have a read me. Then each project will have it's own description page. ",
            "project": "studiosleepygiraffe",
            "title": "Added README."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-07",
            "message": "Conflicts: \tstudiosleepygiraffe/__init__.py ",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'git-post'"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-07",
            "message": "I've decided to leverage the README.md file for the summary of the app. I'll probably end up doing something more interesting in the future, but this is certainly a functional first step, something that allows me to get this website up sooner than later.\n\nI've also re-arranged things a bit. I've moved my git-post/posts.py file into utility-scripts/ folder. It and copy-markdown.py are the occupants of my new utility-scripts folder. These are scripts I'll have to run periodically for now to get the data to show. ",
            "project": "studiosleepygiraffe",
            "title": "Apps now does it's own thing."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-06",
            "message": "Merge branch 'git-post'",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'git-post'"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-06",
            "message": "Merge branch 'git-post' of ssh://studiosleepygiraffe.com:41990/home/toben/Eurus/ssg projects/studiosleepygiraffe into git-post",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'git-post' of ssh://studiosleepygiraffe.com:41990/home/toben/Eurus/ssg projects/studiosleepygiraffe into git-post"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-06",
            "message": "Things can get a bit hap hazard when you are developing across 3 git repos at once! ",
            "project": "studiosleepygiraffe",
            "title": "Missed a file."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-06",
            "message": "Missed a forward slash.",
            "project": "studiosleepygiraffe",
            "title": "Missed a forward slash."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-06",
            "message": "A small fix, but I have updated the pathing for resources. While resource/projects.json worked fine for the dev enviorment, it was failing in production. So I added a bit that I found on stack overflow: https://stackoverflow.com/q/14825787\n\nThis introduced me to getting the location of the current file and saving it as APP_ROOT. This should work in both dev and prod. ",
            "project": "studiosleepygiraffe",
            "title": "APP_ROOT"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-06",
            "message": "I also updated the devlog templates. I'm moving the autoblogging over to the devlog tab like it supposed to be. I'll do write ups for the apps section probably next. Those to will probably also be automated deally bobs. I think I'll use the README.md files for that. This way I can maintain a nice summary page while in the code as usual. I'll probably have this whole site automated by the time I actually feel like publishing it. xD ",
            "project": "studiosleepygiraffe",
            "title": "Merge branch 'nickle' into git-post"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-05",
            "message": "Artifacts.",
            "project": "studiosleepygiraffe",
            "title": "Artifacts."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-05",
            "message": "I had to make a few tweaks to the output to make it easier to work with. Should be good to use now. ",
            "project": "studiosleepygiraffe",
            "title": "Some tweeks."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-07-05",
            "message": "I got the posts.py file working like I want it to now. Turns out there was a trailing '\\n' causing all the problems. But I decided to upgrade the repos file to use json so I could add more info to the projects.\n\nIn looking at this, I might release this as it's own project in the future. Autoblogging via git commit messages is pretty knifty and I think more people than just me would enjoy it. We'll see. Right now I'm jsut happy to get all the projects in to the system. ",
            "project": "studiosleepygiraffe",
            "title": "Works now!"
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-06-29",
            "message": "It is mostly done as a matter of crossed wires. But I've added the feature where commits are posted as blog entries to the apps page. Not entirely intentional. But I was already down that rabbit hole so I kept going. I'll make the appropriate changes soon to move the git commit auto blogging over to the dev log page, which I've yet to make. ^^;\n\nBut it's progress! The site is starting to have some idea of the content that I want in it available. And I'm slowly starting to understand how to piece it all together. It is my first flask app after all. Man, never thought I'd be making web apps. I suppose I never really fancied myself as a mobile developer either. But here we are. Making kivy and flask apps.\n\nTO THE KING! ",
            "project": "studiosleepygiraffe",
            "title": "Apps now are devlogs! Wait."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-06-27",
            "message": "I've added a little more to this. Now there are \"posts\" that will encapsulate all the information for a post. I've run into a problem however which I'm not sure what is causing it. That sentence got weird. I think the user not being able to access the git repo is basically the problem. Which is probably do to clever tricks with the NFS mount not being quite as clever as I want. ",
            "project": "studiosleepygiraffe",
            "title": "Created post objects."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-06-26",
            "message": "This too will one day become a blog post. I'll probably have single line commits be ignored, or tweeted or something. But right now just got it set up so that it will find git commit messages and turn them into a title and a body. ",
            "project": "studiosleepygiraffe",
            "title": "Started work on system for having posts done by git commits."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-04-20",
            "message": "I've got a long way to go. ",
            "project": "studiosleepygiraffe",
            "title": "Some basic layout coming in."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-04-11",
            "message": "Added missing files.",
            "project": "studiosleepygiraffe",
            "title": "Added missing files."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-03-21",
            "message": "Now I'll be able to bother getting something more interesting in place. But also I need to look into ssl certificates. ",
            "project": "studiosleepygiraffe",
            "title": "Basic site is up. I've got a decent looking landing page."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-03-20",
            "message": "Got pictures being served.",
            "project": "studiosleepygiraffe",
            "title": "Got pictures being served."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-03-20",
            "message": "Got templates working.",
            "project": "studiosleepygiraffe",
            "title": "Got templates working."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-03-20",
            "message": "learning how this works. Reduced it back to one file for now.",
            "project": "studiosleepygiraffe",
            "title": "learning how this works. Reduced it back to one file for now."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-03-20",
            "message": "Push test.",
            "project": "studiosleepygiraffe",
            "title": "Push test."
        },
        {
            "author": "Toben Archer",
            "branch": "master",
            "date": "2017-03-20",
            "message": "Initial commit of website.",
            "project": "studiosleepygiraffe",
            "title": "Initial commit of website."
        }
    ],
    "rank": 1,
    "url": "/studiosleepygiraffe"
}